Micro-Digital/SecureSMX/BSP/ARM/LPC55Sxx/NXP/drivers/fsl_casper.c
    for (i = CASPER_RECODE_LENGTH - 2; i >= 0; i--)
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);

        index = int8abs(rec[i]);
        sign  = (int32_t)(uint32_t)(uint8_t)(((uint8_t)rec[i]) >> 7);

        GET_LUT(X, Y, Z, index);

        /* Compute -y and select the positive or negative point. */
        (void)sub_n(scalar, p, Y, (int16_t)(uint16_t)NUM_LIMBS); // todo!!!
        casper_select(scalar, Y, scalar, sign, (int16_t)(uint16_t)NUM_LIMBS);

        Jac_addition(X3, Y3, Z3, X3, Y3, Z3, X, scalar, Z);
    }

    (void)sub_n(M, p, Y3, (int16_t)(uint16_t)NUM_LIMBS); // todo!!!

    casper_select(Y3, M, Y3, odd, (int16_t)(uint16_t)NUM_LIMBS);
}

#undef FSL_CASPER_LUT
#undef GET_LUT

/*
 * Pre-compute the following 16 points:
 * 00 00 = 0*P + 0*Q  <-- Not needed when using sliding windows
 * 00 01 = 0*P + 1*Q  <-- Not needed when using sliding windows
 * 00 10 = 0*P + 2*Q
 * 00 11 = 0*P + 3*Q
 *
 * 01 00 = 1*P + 0*Q  <-- Not needed when using sliding windows
 * 01 01 = 1*P + 1*Q  <-- Not needed when using sliding windows
 * 01 10 = 1*P + 2*Q
 * 01 11 = 1*P + 3*Q
 *
 * 10 00 = 2*P + 0*Q
 * 10 01 = 2*P + 1*Q
 * 10 10 = 2*P + 2*Q
 * 10 11 = 2*P + 3*Q
 *
 * 11 00 = 3*P + 0*Q
 * 11 01 = 3*P + 1*Q
 * 11 10 = 3*P + 2*Q
 * 11 11 = 3*P + 3*Q
 *
 * index = (bitsi||bitsj)-2 - (biti != 0)*2
 *
 * Input:   P = (X1 : Y1 : Z1) and
 *          Q = (X2 : Y2 : Z2)
 * Output: mem, memory location for the LUT.
 */

#define LUT_LIMBS NUM_LIMBS

static void precompute_double_scalar_LUT(uint32_t *Px, uint32_t *Py, uint32_t *Qx, uint32_t *Qy)
{
    uint32_t *Q2x, *Q2y, *Q2z, *P2x, *P2y, *P2z, *Z, *mem;
    uint16_t index = 0;

    Q2x = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 0U * CASPER_NUM_LIMBS];
    Q2y = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 1U * CASPER_NUM_LIMBS];
    Q2z = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 2U * CASPER_NUM_LIMBS];

    /* Re-use memory from different scratch space since no
     * projective point addition is used below. */
    P2x = &CASPER_MEM[ECC_SCRATCH_START + 5U * CASPER_NUM_LIMBS];
    P2z = &CASPER_MEM[ECC_SCRATCH_START + 6U * CASPER_NUM_LIMBS];
    P2y = &CASPER_MEM[ECC_SCRATCH_START + 7U * CASPER_NUM_LIMBS];
    Z   = &CASPER_MEM[ECC_SCRATCH_START + 8U * CASPER_NUM_LIMBS];

    mem = &CASPER_MEM[LUT_SCRATCH_START];

    copy(Z, ONE);

    // 00 10 = 0*P + 2*Q
    Jac_double(Q2x, Q2y, Q2z, Qx, Qy, Z);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 00 11 = 0*P + 3*Q
    Jac_add_affine(P2x, P2y, P2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 01 10 = 1*P + 2*Q
    Jac_add_affine(P2x, P2y, P2z, Q2x, Q2y, Q2z, Px, Py);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 01 11 = 1*P + 3*Q
    Jac_add_affine(P2x, P2y, P2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 10 00 = 2*P + 0*Q
    Jac_double(P2x, P2y, P2z, Px, Py, Z);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 10 01 = 2*P + 1*Q
    Jac_add_affine(Q2x, Q2y, Q2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 10 10 = 2*P + 2*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 10 11 = 2*P + 3*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 11 00 = 3*P + 0*Q
    Jac_add_affine(P2x, P2y, P2z, P2x, P2y, P2z, Px, Py);
    copy(&mem[index], P2x);
    index += LUT_LIMBS;
    copy(&mem[index], P2y);
    index += LUT_LIMBS;
    copy(&mem[index], P2z);
    index += LUT_LIMBS;

    // 11 01 = 3*P + 1*Q
    Jac_add_affine(Q2x, Q2y, Q2z, P2x, P2y, P2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 11 10 = 3*P + 2*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;

    // 11 11 = 3*P + 3*Q
    Jac_add_affine(Q2x, Q2y, Q2z, Q2x, Q2y, Q2z, Qx, Qy);
    copy(&mem[index], Q2x);
    index += LUT_LIMBS;
    copy(&mem[index], Q2y);
    index += LUT_LIMBS;
    copy(&mem[index], Q2z);
    index += LUT_LIMBS;
}

#define GETLUTX(x) (3U * (x)*LUT_LIMBS)
#define GETLUTY(x) (3U * (x)*LUT_LIMBS + 1U * LUT_LIMBS)
#define GETLUTZ(x) (3U * (x)*LUT_LIMBS + 2U * LUT_LIMBS)

/* Compute the double scalar multiplication
 * (X3 : Y3 : Z3) = k1 * (X1, Y1) + k2 * (X2, Y2)
 * Using Shamir's trick and precomputing 16 points.
 * This code is *not* constant time since this is used
 * for verification only.
 */
void double_scalar_multiplication(uint32_t *X3,
                                  uint32_t *Y3,
                                  uint32_t *Z3,
                                  uint32_t *X1,
                                  uint32_t *Y1,
                                  uint32_t *k1,
                                  uint32_t *X2,
                                  uint32_t *Y2,
                                  uint32_t *k2)
{
    uint32_t index, c = 0;
    uint32_t *p1, *p2, x1, x2, *lut, *Tx, *Ty, *Tz;

