Micro-Digital/SecureSMX/BSP/ARM/LPC55Sxx/NXP/drivers/fsl_casper.c
    precompute_double_scalar_LUT(X1, Y1, X2, Y2);

    lut = &CASPER_MEM[LUT_SCRATCH_START];
    p1  = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS];
    p2  = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 1U * CASPER_NUM_LIMBS];

    Tx = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 2U * CASPER_NUM_LIMBS];
    Ty = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 3U * CASPER_NUM_LIMBS];
    Tz = &CASPER_MEM[LUT_SCRATCH_START + 48U * LUT_LIMBS + 4U * CASPER_NUM_LIMBS];

    CASPER_MEMCPY(p1, k1, sizeof(uint32_t) * NUM_LIMBS);
    CASPER_MEMCPY(p2, k2, sizeof(uint32_t) * NUM_LIMBS);

    /* Check if we can slide. */
    while (((casper_get_word(&p1[NUM_LIMBS - 1U]) | casper_get_word(&p2[NUM_LIMBS - 1U])) >> 31) == 0U && c < 256U)
    {
        shiftleft(p1, p1, 1U);
        shiftleft(p2, p2, 1U);
        c++;
        /* No doubling needed. */
    }

    /* Set the first value. */
    x1    = casper_get_word(&p1[NUM_LIMBS - 1U]) >> 30;
    x2    = casper_get_word(&p2[NUM_LIMBS - 1U]) >> 30;
    index = (x2 | (x1 << 2)) - 2U - (uint32_t)(x1 != 0U) * 2U;
    shiftleft(p1, p1, 2U);
    shiftleft(p2, p2, 2U);

    copy(X3, &lut[GETLUTX(index)]);
    copy(Y3, &lut[GETLUTY(index)]);
    copy(Z3, &lut[GETLUTZ(index)]);
    c += 2U;

// todo: create an is_zero function
#if CASPER_ECC_P256
    while ((casper_get_word(&p1[0]) | casper_get_word(&p1[1]) | casper_get_word(&p1[2]) | casper_get_word(&p1[3]) |
            casper_get_word(&p1[4]) | casper_get_word(&p1[5]) | casper_get_word(&p1[6]) | casper_get_word(&p1[7]) |
            casper_get_word(&p2[0]) | casper_get_word(&p2[1]) | casper_get_word(&p2[2]) | casper_get_word(&p2[3]) |
            casper_get_word(&p2[4]) | casper_get_word(&p2[5]) | casper_get_word(&p2[6]) | casper_get_word(&p2[7])) !=
           0U)
    {
#elif CASPER_ECC_P384
    while ((casper_get_word(&p1[0]) | casper_get_word(&p1[1]) | casper_get_word(&p1[2]) | casper_get_word(&p1[3]) |
            casper_get_word(&p1[4]) | casper_get_word(&p1[5]) | casper_get_word(&p1[6]) | casper_get_word(&p1[7]) |
            casper_get_word(&p1[8]) | casper_get_word(&p1[9]) | casper_get_word(&p1[10]) | casper_get_word(&p1[11]) |
            casper_get_word(&p2[0]) | casper_get_word(&p2[1]) | casper_get_word(&p2[2]) | casper_get_word(&p2[3]) |
            casper_get_word(&p2[4]) | casper_get_word(&p2[5]) | casper_get_word(&p2[6]) | casper_get_word(&p2[7]) |
            casper_get_word(&p2[8]) | casper_get_word(&p2[9]) | casper_get_word(&p2[10]) | casper_get_word(&p2[11])) !=
           0U)
    {
#endif
        /* Check if we can slide. */
        while (((casper_get_word(&p1[NUM_LIMBS - 1U]) | casper_get_word(&p2[NUM_LIMBS - 1U])) >> 31) == 0U &&
               c < N_bitlen)
        {
            shiftleft(p1, p1, 1U);
            shiftleft(p2, p2, 1U);
            Jac_double(X3, Y3, Z3, X3, Y3, Z3);
            c++;
        }

        if (c >= (N_bitlen - 1U))
        {
            break;
        }

        /* Double twice. */
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);

        /* Add in the correct value. */
        x1    = casper_get_word(&p1[NUM_LIMBS - 1U]) >> 30;
        x2    = casper_get_word(&p2[NUM_LIMBS - 1U]) >> 30;
        index = (x2 | (x1 << 2)) - 2U - (uint32_t)(x1 != 0U) * 2U;

        shiftleft(p1, p1, 2U);
        shiftleft(p2, p2, 2U);

        copy(Tx, &lut[GETLUTX(index)]);
        copy(Ty, &lut[GETLUTY(index)]);
        copy(Tz, &lut[GETLUTZ(index)]);

        Jac_addition(X3, Y3, Z3, X3, Y3, Z3, Tx, Ty,
                     Tz); //&lut[GETLUTX(index)], &lut[GETLUTY(index)], &lut[GETLUTZ(index)]);
        c += 2U;
    }

    /* Special case in the end. */
    if (c == (N_bitlen - 1U))
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        x1 = casper_get_word(&p1[NUM_LIMBS - 1U]) >> 31;
        x2 = casper_get_word(&p2[NUM_LIMBS - 1U]) >> 31;
        if (0U != x1)
        {
            Jac_add_affine(X3, Y3, Z3, X3, Y3, Z3, X1, Y1);
        }
        if (x2 != 0U)
        {
            Jac_add_affine(X3, Y3, Z3, X3, Y3, Z3, X2, Y2);
        }
        c++;
    }

    while (c < N_bitlen)
    {
        Jac_double(X3, Y3, Z3, X3, Y3, Z3);
        c++;
    }
}

#if CASPER_ECC_P256
static void invert_mod_p256(uint32_t *c, uint32_t *a)
{
    int i;
    uint32_t *t, *t2, *s1, *s2, *s4, *s8, *tmp;

    /* Assuming it is safe to use the ECC scratch size. */
    t   = &CASPER_MEM[ECC_SCRATCH_START + 2U * CASPER_NUM_LIMBS];
    t2  = &CASPER_MEM[ECC_SCRATCH_START + 3U * CASPER_NUM_LIMBS];
    s1  = &CASPER_MEM[ECC_SCRATCH_START + 4U * CASPER_NUM_LIMBS];
    s2  = &CASPER_MEM[ECC_SCRATCH_START + 5U * CASPER_NUM_LIMBS];
    s4  = &CASPER_MEM[ECC_SCRATCH_START + 6U * CASPER_NUM_LIMBS];
    s8  = &CASPER_MEM[ECC_SCRATCH_START + 7U * CASPER_NUM_LIMBS];
    tmp = &CASPER_MEM[ECC_SCRATCH_START + 8U * CASPER_NUM_LIMBS];

    // t2 = n^(2^1)*n  # 11
    square_casper(tmp, a);
    multiply_casper(t2, tmp, a);

    // s1 = t2^(2^2)*t2  # F
    square_casper(s1, t2);
    square_casper(tmp, s1);
    multiply_casper(s1, tmp, t2);

    // s2 = s1^(2^4)*s1  # FF
    square_casper(s2, s1);
    // for (i = 1; i < 4; i++) square(s2, s2);
    square_casper(tmp, s2);
    square_casper(s2, tmp);
    square_casper(tmp, s2);
    multiply_casper(s2, tmp, s1);

    // s4 = s2^(2^8)*s2  # FFFF
    square_casper(s4, s2);
    for (i = 1; i < 7; i += 2)
    {
        square_casper(tmp, s4);
        square_casper(s4, tmp);
    }
    square_casper(tmp, s4);
    multiply_casper(s4, tmp, s2);

    // s8 = s4^(2^16)*s4  # FFFFFFFF
    square_casper(s8, s4);
    for (i = 1; i < 15; i += 2)
    {
        square_casper(tmp, s8);
        square_casper(s8, tmp);
    }
    square_casper(tmp, s8);
    multiply_casper(s8, tmp, s4);

    // t = s8^(2^32)*n  # ffffffff00000001
    square_casper(tmp, s8);
    for (i = 1; i < 31; i += 2)
    {
        square_casper(t, tmp);
        square_casper(tmp, t);
    }
    square_casper(t, tmp);
    multiply_casper(tmp, t, a);

    // t = t^(2^128)*s8 # ffffffff00000001000000000000000000000000ffffffff
    for (i = 0; i < 128; i += 2)
    {
        square_casper(t, tmp);
        square_casper(tmp, t);
    }
    multiply_casper(t, tmp, s8);

    // t = t^(2^32)*s8  # ffffffff00000001000000000000000000000000ffffffffffffffff
    for (i = 0; i < 32; i += 2)
    {
        square_casper(tmp, t);
        square_casper(t, tmp);
    }
    multiply_casper(tmp, t, s8);

    // t = t^(2^16)*s4  # ffffffff00000001000000000000000000000000ffffffffffffffffffff
    for (i = 0; i < 16; i += 2)
    {
        square_casper(t, tmp);
        square_casper(tmp, t);
    }
    multiply_casper(t, tmp, s4);

    // t = t^(2^8)*s2   # ffffffff00000001000000000000000000000000ffffffffffffffffffffff
    for (i = 0; i < 8; i += 2)
    {
        square_casper(tmp, t);
        square_casper(t, tmp);
    }
    multiply_casper(tmp, t, s2);

